# SQL Tutorial

## Overview
In this tutorial, we will look at simple CRUD operations as well as view and stored procedures. 

The flavor of SQL in this tutorial is Postgres. Please note that different flavors of SQL have slightly different syntax.

In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:password@localhost/postgres

'Connected: postgres@postgres'

## Create

Basic syntax of CREATE TABLE statement is as follows:

In [ ]:
CREATE TABLE table_name(
   column1 datatype,
   column2 datatype [OPTIONAL CONSTRAINTS],
   column3 datatype,
   .....
   columnN datatype,
   PRIMARY KEY( one or more columns )
);

Let's create some tables.

In [3]:
%%sql

CREATE SEQUENCE countries_id_seq;

CREATE TABLE countries (
    id integer PRIMARY KEY DEFAULT nextval('countries_id_seq'),
    name varchar(40) UNIQUE NOT NULL CHECK (name <> '')
);

ALTER SEQUENCE countries_id_seq OWNED BY countries.id;

CREATE SEQUENCE alcohol_types_id_seq;

CREATE TABLE alcohol_types (
    id integer PRIMARY KEY DEFAULT nextval('alcohol_types_id_seq'),
    name varchar(40) UNIQUE NOT NULL CHECK (name <> '')
);

ALTER SEQUENCE alcohol_types_id_seq OWNED BY alcohol_types.id;

CREATE SEQUENCE alcohols_id_seq;

CREATE TABLE alcohols (
    id integer PRIMARY KEY DEFAULT nextval('alcohols_id_seq'),
    name varchar(255) NOT NULL CHECK (name <> ''),
    country_id integer references countries(id),
    alcohol_type integer references alcohol_types(id),
    alcohol_content decimal NOT NULL CHECK (alcohol_content > 0) 
);

ALTER SEQUENCE alcohols_id_seq OWNED BY alcohols.id;

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

INSERT INTO TABLE_NAME (column1, column2, column3,...columnN)
VALUES (value1, value2, value3,...valueN);

INSERT INTO TABLE_NAME VALUES (value1,value2,value3,...valueN);

In [4]:
%%sql

TRUNCATE countries CASCADE;
INSERT INTO countries (id, name) VALUES (1, 'France');
INSERT INTO countries VALUES (2, 'Italy');
INSERT INTO countries (id, name) VALUES (3, 'US');
INSERT INTO countries (id, name) VALUES (4, 'scotland');
INSERT INTO countries (id, name) VALUES (5, 'China');
INSERT INTO countries (id, name) VALUES (6, 'Russia');

INSERT INTO alcohol_types (name) VALUES('red wine');
INSERT INTO alcohol_types (name) VALUES('white wine');
INSERT INTO alcohol_types (name) VALUES('rice wine');
INSERT INTO alcohol_types (name) VALUES('cider');
INSERT INTO alcohol_types (name) VALUES('beer');
INSERT INTO alcohol_types (name) VALUES('whisky');

INSERT INTO alcohols (name, country_id, alcohol_type, alcohol_content) 
        VALUES ('Chardonnay', 1, 2, 5.1);
INSERT INTO alcohols (name, country_id, alcohol_type, alcohol_content) 
        VALUES ('Pinot noir', 1, 1, 3.4);
INSERT INTO alcohols (name, country_id, alcohol_type, alcohol_content) 
        VALUES ('Sangiovese', 2, 1, 3.4);
INSERT INTO alcohols (name, country_id, alcohol_type, alcohol_content) 
        VALUES ('Pinot grigio', 2, 2, 5.4);
INSERT INTO alcohols (name, country_id, alcohol_type, alcohol_content) 
        VALUES ('Whisky', 4, 6, 6.4);
INSERT INTO alcohols (name, country_id, alcohol_type, alcohol_content) 
        VALUES ('Bud light', 3, 5, 3.2);

Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## Read

In [ ]:
SELECT column1, column2, columnN FROM table_name;

SELECT * FROM table_name;

SELECT * FROM table_name WHERE (condition);

In [6]:
%%sql

SELECT * FROM alcohols;

6 rows affected.

[(1, 'Chardonnay', 1, 2, Decimal('5.1')),
 (2, 'Pinot noir', 1, 1, Decimal('3.4')),
 (3, 'Sangiovese', 2, 1, Decimal('3.4')),
 (4, 'Pinot grigio', 2, 2, Decimal('5.4')),
 (5, 'Whisky', 4, 6, Decimal('6.4')),
 (6, 'Bud light', 3, 5, Decimal('3.2'))]

In [7]:
%%sql

SELECT alcohols.name, countries.name, alcohol_types.name, alcohols.alcohol_content
FROM alcohols, countries, alcohol_types
WHERE alcohols.country_id = countries.id AND alcohol_types.id = alcohols.alcohol_type;

6 rows affected.

[('Sangiovese', 'Italy', 'red wine', Decimal('3.4')),
 ('Pinot noir', 'France', 'red wine', Decimal('3.4')),
 ('Pinot grigio', 'Italy', 'white wine', Decimal('5.4')),
 ('Chardonnay', 'France', 'white wine', Decimal('5.1')),
 ('Bud light', 'US', 'beer', Decimal('3.2')),
 ('Whisky', 'scotland', 'whisky', Decimal('6.4'))]

In [8]:
%%sql

SELECT alcohols.name, countries.name, alcohol_types.name, alcohols.alcohol_content
FROM alcohols, countries, alcohol_types
WHERE alcohols.country_id = countries.id AND alcohol_types.id = alcohols.alcohol_type
ORDER BY alcohols.alcohol_content DESC
LIMIT 3;

3 rows affected.

[('Whisky', 'scotland', 'whisky', Decimal('6.4')),
 ('Pinot grigio', 'Italy', 'white wine', Decimal('5.4')),
 ('Chardonnay', 'France', 'white wine', Decimal('5.1'))]

In [9]:
%%sql

SELECT alcohols.name, countries.name AS country, alcohol_types.name AS type, alcohols.alcohol_content
FROM alcohols, countries, alcohol_types
WHERE alcohols.country_id = countries.id AND alcohol_types.id = alcohols.alcohol_type 
    AND alcohols.alcohol_content > 5.0;

3 rows affected.

[('Pinot grigio', 'Italy', 'white wine', Decimal('5.4')),
 ('Chardonnay', 'France', 'white wine', Decimal('5.1')),
 ('Whisky', 'scotland', 'whisky', Decimal('6.4'))]

In [10]:
%%sql 

SELECT COUNT(*) FROM alcohols;

1 rows affected.

[(6,)]

In [11]:
%%sql 

SELECT COUNT(*) FROM alcohols WHERE alcohol_content < 5.0;

1 rows affected.

[(3,)]

In [12]:
%%sql 

SELECT * FROM alcohol_types WHERE name LIKE '%wine%';

3 rows affected.

[(1, 'red wine'), (2, 'white wine'), (3, 'rice wine')]

## Update

In [ ]:
UPDATE table_name
SET column1 = value1, column2 = value2...., columnN = valueN
WHERE [condition]; 
# without the WHERE statement, the update will apply to all records.

In [13]:
%%sql

UPDATE countries
SET name = 'Scotland'
WHERE id=4;

1 rows affected.

[]

In [14]:
%%sql

SELECT * FROM countries;

6 rows affected.

[(1, 'France'),
 (2, 'Italy'),
 (3, 'US'),
 (5, 'China'),
 (6, 'Russia'),
 (4, 'Scotland')]

In [15]:
%%sql

ALTER TABLE alcohols RENAME alcohol_content TO content;

Done.

[]

In [16]:
%%sql

SELECT * FROM alcohols;

6 rows affected.

[(1, 'Chardonnay', 1, 2, Decimal('5.1')),
 (2, 'Pinot noir', 1, 1, Decimal('3.4')),
 (3, 'Sangiovese', 2, 1, Decimal('3.4')),
 (4, 'Pinot grigio', 2, 2, Decimal('5.4')),
 (5, 'Whisky', 4, 6, Decimal('6.4')),
 (6, 'Bud light', 3, 5, Decimal('3.2'))]

## Stored Procedures and Views

In [ ]:
CREATE [OR REPLACE] FUNCTION function_name (arguments) 
RETURNS return_datatype AS $variable_name$
  DECLARE
    declaration;
    [...]
  BEGIN
    < function_body >
    [...]
    RETURN { variable_name | value }
  END; LANGUAGE plpgsql;

In [17]:
%%sql

CREATE OR REPLACE FUNCTION add_alcohol (alcohol_name varchar(255), country varchar(40), type varchar(40), alcohol_content decimal)
RETURNS void AS $$
  DECLARE
    alcohol_type_id integer;
    alcohol_country_id integer;
  BEGIN
    INSERT INTO alcohol_types (name) values (type) ON CONFLICT DO NOTHING;
    SELECT alcohol_types.id INTO alcohol_type_id FROM alcohol_types WHERE name = type;
    INSERT INTO countries (name) values (type) ON CONFLICT DO NOTHING;
    SELECT countries.id INTO alcohol_country_id FROM countries WHERE name = country;
    INSERT INTO alcohols (name, country_id, alcohol_type, content) 
            VALUES (alcohol_name, alcohol_country_id, alcohol_type_id, alcohol_content);
  END; 
$$ LANGUAGE plpgsql;

Done.

[]

In [18]:
%%sql

SELECT add_alcohol('Baijiu', 'China', 'rice wine', '10.0');

1 rows affected.

[('',)]

In [19]:
%%sql

SELECT * FROM alcohols;

7 rows affected.

[(1, 'Chardonnay', 1, 2, Decimal('5.1')),
 (2, 'Pinot noir', 1, 1, Decimal('3.4')),
 (3, 'Sangiovese', 2, 1, Decimal('3.4')),
 (4, 'Pinot grigio', 2, 2, Decimal('5.4')),
 (5, 'Whisky', 4, 6, Decimal('6.4')),
 (6, 'Bud light', 3, 5, Decimal('3.2')),
 (7, 'Baijiu', 5, 3, Decimal('10.0'))]

In [ ]:
CREATE [TEMP | TEMPORARY] VIEW view_name AS
SELECT column1, column2.....
FROM table_name
WHERE [condition];

In [20]:
%%sql

CREATE VIEW strong_alcohol AS
SELECT alcohols.name, countries.name AS country, alcohol_types.name AS type, alcohols.content
FROM alcohols, countries, alcohol_types
WHERE alcohols.country_id = countries.id AND alcohol_types.id = alcohols.alcohol_type 
    AND alcohols.content > 5.0;

Done.

[]

In [21]:
%%sql

SELECT * FROM strong_alcohol;

4 rows affected.

[('Pinot grigio', 'Italy', 'white wine', Decimal('5.4')),
 ('Chardonnay', 'France', 'white wine', Decimal('5.1')),
 ('Baijiu', 'China', 'rice wine', Decimal('10.0')),
 ('Whisky', 'Scotland', 'whisky', Decimal('6.4'))]

## Delete

In [ ]:
DELETE FROM table_name
WHERE [condition];

In [22]:
%%sql

SELECT * from alcohol_types;

6 rows affected.

[(1, 'red wine'),
 (2, 'white wine'),
 (3, 'rice wine'),
 (4, 'cider'),
 (5, 'beer'),
 (6, 'whisky')]

In [23]:
%%sql

DELETE FROM alcohol_types
WHERE name = 'cider' ;

1 rows affected.

[]

In [24]:
%%sql
TRUNCATE alcohols CASCADE;

Done.

[]

In [25]:
%%sql

SELECT * FROM alcohols;

0 rows affected.

[]

In [26]:
%%sql

DROP TABLE IF EXISTS alcohols CASCADE;
DROP SEQUENCE IF EXISTS alcohols_id_seq;

DROP TABLE IF EXISTS countries;
DROP SEQUENCE IF EXISTS countries_id_seq;

DROP TABLE IF EXISTS alcohol_types;
DROP SEQUENCE IF EXISTS alcohol_types_id_seq;

Done.
Done.
Done.
Done.
Done.
Done.

[]